---
kind: enumMember
id: F:Autodesk.Revit.DB.Infrastructure.HorizontalCurveType.Line
enum: Autodesk.Revit.DB.Infrastructure.HorizontalCurveType
zh: 线、直线
source: html/786ce1c0-79de-428d-136f-265dc4cffe78.htm
---
# Autodesk.Revit.DB.Infrastructure.HorizontalCurveType.Line

**中文**: 线、直线

Line curve type.